Repository: bjekovicn/quiz_clean_demo
Catalog: lib/core/l10n/app_*.arb
Languages: de, sr

# intro_title
source: Welcome to Trivia Duel!
de: Willkommen bei Trivia Duel!
sr: Dobrodošli u Trivia Duel!

# intro_subtitle1
source: Join the ultimate battle of wits where knowledge meets speed! Compete against your friends or players from around the world in an exciting quiz showdown.
de: Tritt dem ultimativen Wissenskampf bei, wo Wissen auf Geschwindigkeit trifft! Fordere deine Freunde oder Spieler aus der ganzen Welt in einem spannenden Quiz-Duell heraus.
sr: Pridružite se borbi znanja gde brzina i mudrost dolaze do izražaja! Takmičite se protiv svojih prijatelja ili igrača iz celog sveta u uzbudljivom kvizu.

source: Select language
de: Sprache wählen
sr: Izaberite jezik

source: Next
de: Weiter
sr: Dalje

source: Back
de: Zurück
sr: Nazad

# log_in_info
source: To continue using the app, you need to register your account by selecting the Google Sign-In option.
de: Um die App weiter zu nutzen, müssen Sie Ihr Konto registrieren, indem Sie die Option Google-Anmeldung auswählen.
sr: Da biste nastavili sa korišćenjem aplikacije, potrebno je da registrujete svoj nalog izborom opcije Google Prijava.

source: Google Sign In
de: Google-Anmeldung
sr: Google Prijava

# google_sign_in_info
source: To proceed you need to register your account using Google Sign In option...
de: Um fortzufahren, müssen Sie Ihr Konto über die Option Google-Anmeldung registrieren...
sr: Da biste nastavili, potrebno je da registrujete svoj nalog pomoću opcije Google Prijava...

source: Home
de: Startseite
sr: Početna

source: Friends
de: Freunde
sr: Prijatelji

source: Rankings
de: Rangliste
sr: Rang liste

source: Duel Battle
de: Duel-Schlacht
sr: Duel Bitka

# error_occurred
source: Oops, something went wrong...
de: Ups, etwas ist schiefgelaufen...
sr: Ups, nešto je pošlo po zlu...

source: No route found
de: Kein Weg gefunden
sr: Putanja nije pronađena

source: App Name
sr: Naziv aplikacije

source: Success
de: Erfolg
sr: Uspeh

# bad_request_error
source: There was an issue with the request you made. Please check the information and try again.
de: Bei der Anfrage, die Sie gesendet haben, gab es ein Problem. Bitte überprüfen Sie die Informationen und versuchen Sie es erneut.
sr: Došlo je do problema sa zahtevom koji ste poslali. Molimo vas da proverite informacije i pokušate ponovo.

# no_content
source: There is no content available at the moment. Please try again later.
de: Momentan sind keine Inhalte verfügbar. Bitte versuchen Sie es später erneut.
sr: Trenutno nema dostupnog sadržaja. Molimo pokušajte ponovo kasnije.

# forbidden_error
source: You don't have permission to access this resource. Please contact support if you think this is an error.
de: Sie haben keine Berechtigung, auf diese Ressource zuzugreifen. Bitte kontaktieren Sie den Support, wenn Sie denken, dass dies ein Fehler ist.
sr: Nemate dozvolu za pristup ovom resursu. Molimo vas da kontaktirate podršku ako mislite da je ovo greška.

# unauthorized_error
source: You need to be logged in to perform this action. Please log in and try again.
de: Sie müssen angemeldet sein, um diese Aktion auszuführen. Bitte melden Sie sich an und versuchen Sie es erneut.
sr: Morate biti prijavljeni da biste izvršili ovu radnju. Molimo vas da se prijavite i pokušate ponovo.

# not_found_error
source: The resource you are looking for could not be found. It might have been moved or deleted.
de: Die von Ihnen gesuchte Ressource konnte nicht gefunden werden. Sie wurde möglicherweise verschoben oder gelöscht.
sr: Resurs koji tražite nije pronađen. Možda je premešten ili obrisan.

# conflict_error
source: There was a conflict with your request. This could be due to duplicate data or a similar issue.
de: Es gab einen Konflikt mit Ihrer Anfrage. Dies könnte auf doppelte Daten oder ein ähnliches Problem zurückzuführen sein.
sr: Došlo je do sukoba sa vašim zahtevom. Ovo može biti uzrokovano duplim podacima ili sličnim problemom.

# internal_server_error
source: Something went wrong on our end. Please try again later or contact support if the issue persists.
de: Etwas ist auf unserer Seite schiefgelaufen. Bitte versuchen Sie es später erneut oder kontaktieren Sie den Support, wenn das Problem weiterhin besteht.
sr: Nešto nije u redu na našoj strani. Molimo vas da pokušate ponovo kasnije ili kontaktirate podršku ako problem potraje.

# unknown_error
source: An unexpected error occurred. Please try again or contact support for assistance.
de: Ein unerwarteter Fehler ist aufgetreten. Bitte versuchen Sie es erneut oder kontaktieren Sie den Support für Hilfe.
sr: Došlo je do neočekivane greške. Molimo vas da pokušate ponovo ili kontaktirate podršku za pomoć.

# timeout_error
source: The request took too long to complete. Please check your internet connection and try again.
de: Die Anfrage hat zu lange gedauert, um abzuschließen. Bitte überprüfen Sie Ihre Internetverbindung und versuchen Sie es erneut.
sr: Zahtev je trajao predugo da bi se završio. Molimo vas da proverite vašu internet konekciju i pokušate ponovo.

# default_error
source: An error occurred while processing your request. Please try again later.
de: Bei der Verarbeitung Ihrer Anfrage ist ein Fehler aufgetreten. Bitte versuchen Sie es später erneut.
sr: Došlo je do greške prilikom obrade vašeg zahteva. Molimo vas da pokušate ponovo kasnije.

# cache_error
source: There was an issue retrieving cached data. Please refresh the page or try again.
de: Es gab ein Problem beim Abrufen von zwischengespeicherten Daten. Bitte aktualisieren Sie die Seite oder versuchen Sie es erneut.
sr: Došlo je do problema prilikom preuzimanja keširanih podataka. Molimo vas da osvežite stranicu ili pokušate ponovo.

# no_internet_error
source: It seems you're offline. Please check your internet connection and try again.
de: Es scheint, dass Sie offline sind. Bitte überprüfen Sie Ihre Internetverbindung und versuchen Sie es erneut.
sr: Izgleda da ste offline. Molimo vas da proverite vašu internet konekciju i pokušate ponovo.

source: Tokens
sr: Tokeni

source: Coins
de: Münzen
sr: Novčići

source: Welcome
de: Willkommen
sr: Dobro došli

# added_success
source: Friend added successfully
de: Freund erfolgreich hinzugefügt
sr: Prijatelj uspešno dodat

# removed_success
source: Friend removed successfully
de: Freund erfolgreich entfernt
sr: Prijatelj uspešno uklonjen

source: Requests
de: Anfragen
sr: Zahtevi

# no_friends_found
source: There is no friends found
de: Keine Freunde gefunden
sr: Nema pronaćenih prijatelja

# no_requests_found
source: There is no requests found
de: Keine Anfragen gefunden
sr: Nema pronađenih zahtjeva

source: Loading
de: Laden
sr: Učitavanje

source: QR Scan
de: QR Sken
sr: QR Skeniranje

source: QR Display
de: QR Prikaz
sr: QR Prikaz

# qr_instruction
source: Use QR to Connect with your Friends
de: Nutze QR, um dich mit deinen Freunden zu verbinden
sr: Koristi QR da se povežeš sa prijateljima

source: Add Friend
de: Freund hinzufügen
sr: Dodaj prijatelja

source: Challenge Friend
de: Freund herausfordern
sr: Izazovi prijatelja

source: Remove Friend
de: Freund entfernen
sr: Ukloni prijatelja

# game_starting
source: Game will begin as soon as your opponent is found. Please hold on!
de: Das Spiel beginnt, sobald wir Ihren Gegner gefunden haben. Bitte warten Sie!
sr: Trenutno smo u procesu povezivanja Vas sa Vašim protivnicima. Vaša igra će početi uskoro. Molimo vas za malo strpljenja 😊

# random_opponent_duel
source: Quick one-on-one trivia duel with a random opponent — jump in and test your skills!
de: Schnelles Eins-gegen-Eins-Trivia-Duell mit einem zufälligen Gegner – steig ein und teste deine Fähigkeiten!
sr: Brzi jedan-na-jedan kviz duel sa slučajnim protivnikom – uskoči i testiraj svoje veštine!

# challenge_friend_duel
source: One-on-one trivia duel with a friend — send a challenge and see who's the ultimate trivia master!
de: Eins-gegen-Eins-Trivia-Duell mit einem Freund – sende eine Herausforderung und finde heraus, wer der ultimative Trivia-Meister ist!
sr: Jedan-na-jedan kviz duel sa prijateljem – pošalji izazov i saznaj ko je pravi majstor kviza!

# challenge_friends_battle
source: Multiplayer trivia battle with friends — invite them for a thrilling group showdown!
de: Multiplayer-Trivia-Battle mit Freunden – lade sie zu einem aufregenden Gruppen-Duell ein!
sr: Kviz bitka sa prijateljima – pozovi ih na uzbudljiv grupni okršaj!

source: Random Opponent
de: Zufälliger Gegner
sr: Slučajni protivnik

source: Challenge a Friend
de: Fordere einen Freund heraus
sr: Izazovi prijatelja

source: Challenge Friends
de: Freunde herausfordern
sr: Izazovi prijatelje

# game_challenge_title
source: Game Challenge
de: Spielherausforderung
sr: Izazov u igri

# invitation_message
source: invited you to join a Trivia Quiz Battle! 🧠
de: hat dich eingeladen, an einem Trivia Quiz Battle teilzunehmen! 🧠
sr: te pozvao/la da se pridružiš Trivia Quiz Bitci! 🧠

# accept_challenge_question
source: Do you accept the challenge?
de: Nimmst du die Herausforderung an?
sr: Da li prihvataš izazov?

# decline_button
source: Decline
de: Ablehnen
sr: Odbij

# accept_button
source: Accept
de: Akzeptieren
sr: Prihvati

# noUsersInGameRoom
source: There are no users in the game room. To start the game, you need to add at least one friend to the room.
de: Es gibt keine Benutzer im Spielraum. Um das Spiel zu starten, müssen Sie mindestens einen Freund in den Raum hinzufügen.
sr: Nema korisnika u sobi za igru. Da biste započeli igru, morate dodati barem jednog prijatelja u sobu.

# startGameButton
source: Start Game
de: Spiel starten
sr: Započni igru

source: Creating Game Room
de: Spielraum erstellen
sr: Kreiranje sobe za igru

# local_name
source: sr
de: de
